codeigniter/app/Controllers/Home.php

SELECT *
FROM `users`
---
    public function users()
    {
        if (!$this->session->has('user')) {
            return redirect()->to('/login');
        }
        $user_model = new UserModel();
        $users = $user_model->findAll();
        $loggedinUser = $this->session->get('user');

SELECT *
FROM `users`
WHERE `email` = 'ibbu@gmail.com'
 LIMIT 1
---
    public function login()
    {
        if ($this->session->has('user')) {
            return redirect()->to('/users');
        }
        if (isset($_POST['email'])) {
            $user_model = new UserModel();
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');
            $user = $user_model->where('email', $email)->first();

SELECT *
FROM `campaign`
---
    public function campaigns()
    {
        if (!$this->session->has('user')) {
            return redirect()->to('/login');
        }
        $campaign_model = new CampaignModel();
        $campaigns = $campaign_model->findAll();

SELECT *
FROM `campaign`
---
    public function addcampaign()
    {
        if (isset($_POST['name'])) {
            $campaign_model = new CampaignModel();
            $data = [
                'name' => $this->request->getPost('name'),
                'description' => $this->request->getPost('description'),
                'client' => $this->request->getPost('client'),
            ];
            $result = $campaign_model->save($data);
            if ($result) {
                return redirect()->to('/campaigns')->with('success', 'campaign added successfully!');

SELECT *
FROM `users`
---
    public function accessLevel()
    {
        $user_model = new UserModel();
        $users = $user_model->findAll();
        $loggedinUser = $this->session->get('user');

SELECT *
FROM `users`
---
    public function updateRole($id)
    {
        $newRole = $this->request->getPost('roles');
        $loggedinUser = $this->session->get('user');