codeigniter/app/Controllers/Home.php

SELECT *
FROM `campaign`
---
    public function campaigns()
    {
        if (!$this->session->has('user')) {
            return redirect()->to('/login');
        }
        $campaign_model = new CampaignModel();
        $campaigns = $campaign_model->findAll();

SELECT *
FROM `campaign`
WHERE `campaign`.`id` = '4'
---
    public function deleteCampaign($id)
    {
        $campaign_model = new CampaignModel();
        // Check if campaign exists
        $campaign = $campaign_model->find($id); // Or however you check for the campaign existence

DELETE FROM `campaign`
WHERE `id` IN ('4')
---
        ];

        // Delete the user from the database
        $result = $campaign_model->delete($id);

INSERT INTO `auditlog` (`datetime`, `action`, `user_id`, `name`, `logs`) VALUES ('2025-01-07 12:04:51', 'delete', '1', 'Farhaan', 'Campaign with ID 4 was deleted.')
---
        // If the delete is successful, save the audit log
        if ($result) {
            // Save the audit log entry
            $auditlog_model->save($auditData);